[
  {
    "date": "2022-11 - 2023-01",
    "startDate": "2022-11-01",
    "title": "NOS - Personal Development Plan",
    "description": "Develop an SAPUI5 BTP application to be used in SuccessFactors for employees to check the progress and add suggestions to their yearly development plans, additionally, a manager view, for managers to create and edit their team members' plans.",
    "demo": "PDP"
  },
  {
    "date": "2022-12 - 2023-01",
    "startDate": "2022-12-01",
    "title": "NOS - Feedback App",
    "description": "Develop an SAPUI5 BTP application to be used in SuccessFactors for employees to request and reply to feedback requests."
  },
  {
    "date": "2023-02 - 2023-04",
    "startDate": "2023-02-01",
    "title": "NOS - Migrate Applications",
    "description": "Migrate 3 different applications from their ESS portal to BTP to be used in SuccessFactors, these applications were: Docs (Payslip/Income Statement), Supplementary Work Cinemas and Supplementary Work Telco."
  },
  {
    "date": "2023-04 - 2023-04",
    "startDate": "2023-04-01",
    "title": "Navigator - BIRT Employee File",
    "description": "Develop a BIRT report for Employee File data."
  },
  {
    "date": "2023-04 - 2023-06",
    "startDate": "2023-04-01",
    "title": "Bensaude - EC - Cornerstone Integrations",
    "description": "Develop custom SAP CPI Integration Flows to integrate Master Data and Organizational Data from SuccessFactors Employee Central to Cornerstone OnDemand."
  },
  {
    "date": "2023-06 - 2023-07",
    "startDate": "2023-06-01",
    "title": "SONAE - BIRT SF 360 Evaluation",
    "description": "Update the logic of BIRT reports related to SuccessFactors's 360 Employee Evaluation."
  },
  {
    "date": "2023-08 - 2023-12",
    "startDate": "2023-08-01",
    "title": "EDP - Onboarding 2.0",
    "description": "Develop two SAPUI5 BTP applications, one to be used when creating a new employee profile through Onboarding2.0 APIs, the goal was to use a custom employee ID which wasn't available through standard Onboarding2.0. One to be used to check the status of the onboarding emails sent to the new employee."
  },
  {
    "date": "2023-12 - 2023-01",
    "startDate": "2023-12-01",
    "title": "FNAC - BIRT Certifications",
    "description": "Develop custom BIRT reports for SuccessFactors LMS certifications."
  },
  {
    "date": "2024-01 - 2024-04",
    "startDate": "2024-01-01",
    "title": "NOS - Benefits App",
    "description": "Develop an SAPUI5 BTP application to be used in SuccessFactors, with the goal of accessing benefits data via a PDF generated in SAP through an Adobe Form, the employee would choose a month and year and would get their pdf for the selected data."
  },
  {
    "date": "2024-04 - 2024-05",
    "startDate": "2024-04-01",
    "title": "NOS - EC - SAP R/3 Integrations",
    "description": "Develop a custom SAP CPI Integration Flow to integrate Contingent data from SuccessFactors Employee Central to SAP IT2006."
  },
  {
    "date": "2024-06 - 2025-01",
    "startDate": "2024-06-01",
    "title": "Banco de Portugal - EC - SAP Integrations",
    "description": "Setup the initial connection between SAP and BTP with the goal of implementing standard Employee Central to SAP R/3 Master Data and Organizational data integrations, development of custom SAP CPI integration flows for specific Employee Central Data."
  },
  {
    "date": "2024-07 - 2025-09",
    "startDate": "2024-07-01",
    "title": "MotaEngil - Global Template",
    "description": "Development of a custom infotype, configuration tables, data population reports and time evaluation functions and operations to revamp the time evaluation structure of several countries within the ME Group."
  },
  {
    "date": "2024-10 - 2025-09",
    "startDate": "2024-10-01",
    "title": "MotaEngil - TiME On Site",
    "description": "Develop an SAPUI5 BTP application for SuccessFactors with the goal of analyzing, updating and manually creating absences and overtime generated by time evaluation, capable of: substitutions, altering/creating Clock-ins/Clock-outs and reclassifying absences/overtime motives, also includes a Dashboard to check and compare overtime data with past values."
  }
]
